RSN/src/InformationRegisters/РезультатыОбработкиДанных/РезультатыОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыОбработкиДанных</name>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ОбработчикРезультата</name>
    <type>
      <types>CatalogRef.ОбработчикиРезультатовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяИнициации</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/РезультатыОбработкиДанных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Для внутреннего использования.
// 
Процедура ЗаписатьРезультат(Параметры, ТекстОшибки = "") Экспорт
	
	РезультатыОбработкиДанных = СоздатьМенеджерЗаписи();   
	РезультатыОбработкиДанных.Идентификатор = Параметры.Идентификатор;
	РезультатыОбработкиДанных.ВремяИнициации = Параметры.ВремяИнициации;  
	
	РезультатыОбработкиДанных.ОбработчикРезультата = Параметры.ОбработчикРезультата; 
	РезультатыОбработкиДанных.Обработано = Не ЗначениеЗаполнено(ТекстОшибки); 
	РезультатыОбработкиДанных.ТекстОшибки = ТекстОшибки;
	
	РезультатыОбработкиДанных.Записать(Истина);
				
КонецПроцедуры


#КонецОбласти

#КонецЕсли
